Solver_Examples/AEFoam/Run_Case/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);

